In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
df = pd.read_csv('books.csv', encoding='latin1')
df.head()

,publisher,dagger,book_review_link,author,primary_isbn10,price,primary_isbn13,sunday_review_link,date,first_chapter_link,contributor,title,age_group,weeks_on_list
0,Riverhead,0,https://www.nytimes.com/2015/01/05/books/the-g...,Paula Hawkins,1594634025,0,9.78E+12,https://www.nytimes.com/2015/02/01/books/revie...,2/19/2017,NaN,by Paula Hawkins,THE GIRL ON THE TRAIN,NaN,102
1,Scribner,0,NaN,Anthony Doerr,1501173219,0,9.78E+12,https://www.nytimes.com/2014/05/11/books/revie...,5/7/2017,NaN,by Anthony Doerr,ALL THE LIGHT WE CANNOT SEE,NaN,81
2,Vintage,0,NaN,E L James,525431888,0,9.78E+12,NaN,3/5/2017,NaN,by E. L. James,FIFTY SHADES DARKER,NaN,66
3,St. Martin's,0,NaN,Kristin Hannah,1466850604,0,9.78E+12,NaN,10/29/2017,NaN,by Kristin Hannah,THE NIGHTINGALE,NaN,63
4,Penguin Group,0,https://www.nytimes.com/2009/02/19/books/19mas...,Kathryn Stockett,1440697663,0,9.78E+12,NaN,4/8/2012,NaN,by Kathryn Stockett,THE HELP,NaN,58

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2249 entries, 0 to 2248
Data columns (total 14 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   publisher           2249 non-null   object
 1   dagger              2249 non-null   int64
 2   book_review_link    136 non-null    object
 3   author              2249 non-null   object
 4   primary_isbn10      2073 non-null   object
 5   price               2249 non-null   int64
 6   primary_isbn13      2248 non-null   object
 7   sunday_review_link  130 non-null    object
 8   date                2249 non-null   object
 9   first_chapter_link  6 non-null      object
 10  contributor         2249 non-null   object
 11  title               2249 non-null   object
 12  age_group           0 non-null      float64
 13  weeks_on_list       2249 non-null   int64
dtypes: float64(1), int64(3), object(10)
memory usage: 246.1+ KB

# Missing Values

In [4]:
# Check for missing values in each column
df.isna().sum()

publisher                0
dagger                   0
book_review_link      2113
author                   0
primary_isbn10         176
price                    0
primary_isbn13           1
sunday_review_link    2119
date                     0
first_chapter_link    2243
contributor              0
title                    0
age_group             2249
weeks_on_list            0
dtype: int64

There seem to be a lot of missing values (94% to 99%) in columns 'book_review_link', 'sunday_review_link', and 'first_chapter_link'. All these three columns are dropped as it will be useless to keep them in the dataset. I will use API later to add more necessary columns/features later.

In [5]:
df = df.drop(columns=['book_review_link', 'sunday_review_link', 'first_chapter_link'] , axis=1).copy()
df.head()

,publisher,dagger,author,primary_isbn10,price,primary_isbn13,date,contributor,title,age_group,weeks_on_list
0,Riverhead,0,Paula Hawkins,1594634025,0,9.78E+12,2/19/2017,by Paula Hawkins,THE GIRL ON THE TRAIN,NaN,102
1,Scribner,0,Anthony Doerr,1501173219,0,9.78E+12,5/7/2017,by Anthony Doerr,ALL THE LIGHT WE CANNOT SEE,NaN,81
2,Vintage,0,E L James,525431888,0,9.78E+12,3/5/2017,by E. L. James,FIFTY SHADES DARKER,NaN,66
3,St. Martin's,0,Kristin Hannah,1466850604,0,9.78E+12,10/29/2017,by Kristin Hannah,THE NIGHTINGALE,NaN,63
4,Penguin Group,0,Kathryn Stockett,1440697663,0,9.78E+12,4/8/2012,by Kathryn Stockett,THE HELP,NaN,58

In [6]:
df['age_group'].isna().sum()

2249

In [7]:
df['age_group'].nunique()

0

##### Comment: 
All of the rows in 'age_group' columns contain all null values as there seems to be no information about the age group. 
Therefore, it is better to drop the entire column.

In [8]:
# Drop 'age_group' column from the dataset
df = df.drop(columns=['age_group'], axis=1).copy()
df.head()

,publisher,dagger,author,primary_isbn10,price,primary_isbn13,date,contributor,title,weeks_on_list
0,Riverhead,0,Paula Hawkins,1594634025,0,9.78E+12,2/19/2017,by Paula Hawkins,THE GIRL ON THE TRAIN,102
1,Scribner,0,Anthony Doerr,1501173219,0,9.78E+12,5/7/2017,by Anthony Doerr,ALL THE LIGHT WE CANNOT SEE,81
2,Vintage,0,E L James,525431888,0,9.78E+12,3/5/2017,by E. L. James,FIFTY SHADES DARKER,66
3,St. Martin's,0,Kristin Hannah,1466850604,0,9.78E+12,10/29/2017,by Kristin Hannah,THE NIGHTINGALE,63
4,Penguin Group,0,Kathryn Stockett,1440697663,0,9.78E+12,4/8/2012,by Kathryn Stockett,THE HELP,58

In [9]:
# Check the unique value(s) in 'dagger' column
df['dagger'].value_counts(normalize=True)

0    1.0
Name: dagger, dtype: float64

In [10]:
# Check the unique value(s) in 'price' column
df['price'].value_counts(normalize=True)

0    1.0
Name: price, dtype: float64

##### Comment:
Both of the 'dagger' and 'price' columns have 100% of '0' value which indicates that there is no information on dagger of price for the books. Therefore, it is best to drop them from the dataset as there is no use to keep them for building model later.

In [11]:
# Drop both of the 'dagger' and 'price' columns
df = df.drop(columns=['dagger', 'price'], axis=1).copy()

In [12]:
df.isna().sum()

publisher           0
author              0
primary_isbn10    176
primary_isbn13      1
date                0
contributor         0
title               0
weeks_on_list       0
dtype: int64

In [13]:
df['primary_isbn10'].str.contains('None').value_counts()[True]

631

##### Comment:
ISBN is a unique ID for each book. Therefore, we cannot replace or fill it with the mean or median of all other values in the same columns. The missing values which indicates as 'NA' in 'primary_isbn10' are about 7% of entire data, but there are also rows that contain string 'None'. Together, the missing values and 'None' values are about 35% of entire dataset. Therefore, we cannot drop them from the dataset. Instead, null values will be replaced with string 'None' and they will be treated as its own category.

In [14]:
df['primary_isbn10'].fillna('None', inplace=True)

##### Comment:
There is only 1 null value in 'primary_isbn13'. We will drop it from the dataset

In [15]:
df.dropna(how='any', inplace=True)

In [16]:
df.isna().sum()

publisher         0
author            0
primary_isbn10    0
primary_isbn13    0
date              0
contributor       0
title             0
weeks_on_list     0
dtype: int64

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2248 entries, 0 to 2248
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   publisher       2248 non-null   object
 1   author          2248 non-null   object
 2   primary_isbn10  2248 non-null   object
 3   primary_isbn13  2248 non-null   object
 4   date            2248 non-null   object
 5   contributor     2248 non-null   object
 6   title           2248 non-null   object
 7   weeks_on_list   2248 non-null   int64
dtypes: int64(1), object(7)
memory usage: 158.1+ KB

# Reformat 'date' column

In [18]:
df['date'] = pd.to_datetime(df['date'])
print(df['date'].dtype)
df.head()

datetime64[ns]

,publisher,author,primary_isbn10,primary_isbn13,date,contributor,title,weeks_on_list
0,Riverhead,Paula Hawkins,1594634025,9.78E+12,2017-02-19,by Paula Hawkins,THE GIRL ON THE TRAIN,102
1,Scribner,Anthony Doerr,1501173219,9.78E+12,2017-05-07,by Anthony Doerr,ALL THE LIGHT WE CANNOT SEE,81
2,Vintage,E L James,525431888,9.78E+12,2017-03-05,by E. L. James,FIFTY SHADES DARKER,66
3,St. Martin's,Kristin Hannah,1466850604,9.78E+12,2017-10-29,by Kristin Hannah,THE NIGHTINGALE,63
4,Penguin Group,Kathryn Stockett,1440697663,9.78E+12,2012-04-08,by Kathryn Stockett,THE HELP,58

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2248 entries, 0 to 2248
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   publisher       2248 non-null   object
 1   author          2248 non-null   object
 2   primary_isbn10  2248 non-null   object
 3   primary_isbn13  2248 non-null   object
 4   date            2248 non-null   datetime64[ns]
 5   contributor     2248 non-null   object
 6   title           2248 non-null   object
 7   weeks_on_list   2248 non-null   int64
dtypes: datetime64[ns](1), int64(1), object(6)
memory usage: 158.1+ KB

# 10-digit ISBNs

A lot of ISBN values in 'primary_isbn10' have only 9 digits. It is because the first digit suppose to be '0'. Therefore, we will add '0' to any ISBN that has only 9 digits

In [20]:
for col in df['primary_isbn10']:
    colstr = str(col)
    if len(colstr) == 9:
        df['primary_isbn10'] = df['primary_isbn10'].replace(col, str(0)+col)

There are also ISBNs with only 8 digits. We will add 2 '00' in front of any ISBNs with 8 digits.

In [21]:
for col in df['primary_isbn10']:
    colstr = str(col)
    if len(colstr) == 8:
        df['primary_isbn10'] = df['primary_isbn10'].replace(col, "00"+col)

In [22]:
df.head()

,publisher,author,primary_isbn10,primary_isbn13,date,contributor,title,weeks_on_list
0,Riverhead,Paula Hawkins,1594634025,9.78E+12,2017-02-19,by Paula Hawkins,THE GIRL ON THE TRAIN,102
1,Scribner,Anthony Doerr,1501173219,9.78E+12,2017-05-07,by Anthony Doerr,ALL THE LIGHT WE CANNOT SEE,81
2,Vintage,E L James,0525431888,9.78E+12,2017-03-05,by E. L. James,FIFTY SHADES DARKER,66
3,St. Martin's,Kristin Hannah,1466850604,9.78E+12,2017-10-29,by Kristin Hannah,THE NIGHTINGALE,63
4,Penguin Group,Kathryn Stockett,1440697663,9.78E+12,2012-04-08,by Kathryn Stockett,THE HELP,58

# A new column for number of words in each book title

In [23]:
df['no_of_words_title'] = df.title.apply(lambda x: len(x.split()))

In [24]:
df.head()

,publisher,author,primary_isbn10,primary_isbn13,date,contributor,title,weeks_on_list,no_of_words_title
0,Riverhead,Paula Hawkins,1594634025,9.78E+12,2017-02-19,by Paula Hawkins,THE GIRL ON THE TRAIN,102,5
1,Scribner,Anthony Doerr,1501173219,9.78E+12,2017-05-07,by Anthony Doerr,ALL THE LIGHT WE CANNOT SEE,81,6
2,Vintage,E L James,0525431888,9.78E+12,2017-03-05,by E. L. James,FIFTY SHADES DARKER,66,3
3,St. Martin's,Kristin Hannah,1466850604,9.78E+12,2017-10-29,by Kristin Hannah,THE NIGHTINGALE,63,2
4,Penguin Group,Kathryn Stockett,1440697663,9.78E+12,2012-04-08,by Kathryn Stockett,THE HELP,58,2

# Drop unnecessary columns

* We will mainly use ISBN-10 for merging purposes with dataframe from API later, so ISBN-13 will be eliminated.
* 'contributor' is very similiar to 'author'. Therefore, we just need to keep the 'author' column for later analysis.

In [25]:
df = df.drop(columns=['primary_isbn13', 'contributor'], axis=1).copy()

In [26]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2248 entries, 0 to 2248
Data columns (total 7 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   publisher          2248 non-null   object
 1   author             2248 non-null   object
 2   primary_isbn10     2248 non-null   object
 3   date               2248 non-null   datetime64[ns]
 4   title              2248 non-null   object
 5   weeks_on_list      2248 non-null   int64
 6   no_of_words_title  2248 non-null   int64
dtypes: datetime64[ns](1), int64(2), object(4)
memory usage: 140.5+ KB

In [27]:
df.head()

,publisher,author,primary_isbn10,date,title,weeks_on_list,no_of_words_title
0,Riverhead,Paula Hawkins,1594634025,2017-02-19,THE GIRL ON THE TRAIN,102,5
1,Scribner,Anthony Doerr,1501173219,2017-05-07,ALL THE LIGHT WE CANNOT SEE,81,6
2,Vintage,E L James,0525431888,2017-03-05,FIFTY SHADES DARKER,66,3
3,St. Martin's,Kristin Hannah,1466850604,2017-10-29,THE NIGHTINGALE,63,2
4,Penguin Group,Kathryn Stockett,1440697663,2012-04-08,THE HELP,58,2

# Rename the column

In [28]:
# Rename the 'primary_isbn10' column for easier processing later
df = df.rename(columns={'primary_isbn10':'isbn'})

# Save cleaned dataset into a new csv file

In [29]:
df.to_csv('cleaned_books_modeling.csv')